// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");


// Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24 5 -> 120

// System.Console.WriteLine("введите число");
// int N = Convert.ToInt32(Console.ReadLine());

// int result = 1;
// for(int i = 1; i<=N; i++)
// {
//     result*=i;
// }
// Console.WriteLine(result);




